{
    "JobData": [
        {
            "Title": "Software Engineer",
            "Company": "Brock Solutions",
            "Location": "Kitchener, ON, CA",
            "Time": "July 2023 – Present",
            "Points": [
                "Collaborated in a team to develop a file management system for mechanics and electricians, allowing them to upload and interact with mechanical and electrical drawings, which reduced the time spent managing files by 30%.",
                "Integrated a custom PDF viewer with annotation capabilities into the file management system, reducing the company’s licensing fees by over $14,000 annually while providing enhanced functionality.",
                "Implemented CI/CD pipelines using Azure and PowerShell, ensuring smooth deployments for over 100,000 active users without service disruptions.",
                "Modernized microservices across multiple airports handling baggage sorting for 1M+ users, improving performance and reducing security vulnerabilities by 27%."
            ]
        },
        {
            "Title": "Software Engineer Intern",
            "Company": "RBC",
            "Location": "Toronto, ON, CA",
            "Time": "May 2022 – Aug 2022",
            "Points": [
                "Streamlined audit processes for 12,000+ employees by automating data processing in ServiceNow, saving over 50 hours monthly.",
                "Improved collaboration by integrating Splunk into ServiceNow, reducing data retrieval time by 27% and enhancing access to critical information."
            ]
        },
        {
            "Title": "Workshops and Talks Lead",
            "Company": "Google Developer Student Club McMaster University",
            "Location": "Hamilton, ON, CA",
            "Time": "Sep 2021 – Apr 2023",
            "Points": [
                "Led a team of 20 members to organize workshops and talks for the Google DSC and McMaster Community.",
                "Organized content and presented in an AR Development workshop for 1000+ viewers and contributed greatly towards making McMaster’s GDSC chapter one of North America’s most active chapters.",
                "Assisted in presenting, delegating tasks and curating content for workshops such as Intro to Github, Basics of Unity, and a ML talk with Tanmay Bakshi, that had over 100+ attendees."
            ]
        },
        {
            "Title": "Software Engineer Intern",
            "Company": "Loadlink Technologies",
            "Location": "Mississauga, ON, CA",
            "Time": "May 2021 – Aug 2021",
            "Points": [
                "Redesigned the front-end of a load-matching application, improving user engagement by 27% post-rebranding while ensuring compliance with new company guidelines.",
                "Developed a notification system that integrated with an external marketplace, reducing average item listing duration by 9 days.",
                "Automated data processing workflows, reducing manual effort by 34 hours per week."
            ]
        },
        {
            "Title": "Teaching Assistant",
            "Company": "McMaster University",
            "Location": "Hamilton, ON, CA",
            "Time": "Sep 2020 – Apr 2021; Sep 2021 – Dec 2021",
            "Points": [
                "Instructed 50+ students to design and develop scripts in Python for solving various Engineering problems."
            ]
        },
        {
            "Title": "Software Engineer Intern",
            "Company": "PULSE Lifesavings",
            "Location": "Hamilton, ON, CA",
            "Time": "May 2020 – Aug 2020",
            "Points": [
                "Developed an innovative CPR training tool in Unity, improving posture detection by 67% and enhancing training efficiency.",
                "Built an Android app to improve CPR posture feedback for users, enabling faster and more accurate training results."
            ]
        }
    ]
}